{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "balanced-weapon",
   "metadata": {},
   "source": [
    "### Множества. Задачи. Часть 2\n",
    "\n",
    "**Задача 1. Пересадки.**   \n",
    "На Новом проспекте для разгрузки было решено пустить два новых автобусных маршрута на разных участках проспекта.  Известны конечные остановки каждого из автобусов. Определите количество остановок, на  которых можно пересесть с одного автобуса на другой.   \n",
    "\n",
    "Формат ввода: Вводятся четыре числа, не превосходящие 100, задающие номера конечных остановок. Сначала для первого, потом второго автобуса (см. примеры и рисунок).   \n",
    "Формат вывода: Ваша программа должна выводить одно число – искомое количество остановок.     \n",
    "\n",
    "Пример ввода: 3 6 4 2   \n",
    "Вывод: 2   \n",
    "\n",
    "Пример ввода: 3 1 5 10   \n",
    "Вывод: 0   \n",
    " "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "informative-remedy",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4\n"
     ]
    }
   ],
   "source": [
    "inp = list(map(int, input().split()))\n",
    "\n",
    "fst = sorted(inp[:2])\n",
    "scnd = sorted(inp[2:])\n",
    "\n",
    "\n",
    "print(max(0, min(fst[1], scnd[1]) - max(fst[0], scnd[0]) + 1))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "above-conditions",
   "metadata": {},
   "source": [
    "**Задача 2. Забастовки.**   \n",
    "Политическая жизнь одной страны очень оживленная. В стране действует K политических партий, каждая из которых регулярно объявляет национальную забастовку. Дни, когда хотя бы одна из партий объявляет забастовку, при условии, что это не суббота или воскресенье (когда и так никто не работает), наносят большой ущерб экономике страны. i-я партия объявляет забастовки строго каждые bi дней, начиная с дня с номером ai. То есть i-я партия объявляет забастовки в дни ai, ai+bi, ai+2bi и т.д. Если в какой-то день несколько партий объявляет забастовку, то это считается одной общенациональной забастовкой. В календаре страны N дней, пронумерованных от 1 до N. Первый день года является понедельником, шестой и седьмой дни года — выходные, неделя состоит из семи дней.   \n",
    "\n",
    "Формат ввода: Программа получает на вход число дней в году N и число политических партий K. Далее идет K строк, описывающие графики проведения забастовок. i-я строка содержит числа ai и bi (1≤ ai, bi≤ N).   \n",
    "\n",
    "Формат вывода: Выведите единственное число: количество забастовок, произошедших в течение года.   \n",
    "\n",
    "Пример ввода:   \n",
    "19 3   \n",
    "2 3   \n",
    "3 5   \n",
    "9 8   \n",
    "\n",
    "Вывод:   \n",
    "8   \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "corrected-german",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{2, 3, 5, 8, 9, 11, 17, 18}\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "numdays, numParties = list(map(int, input().split()))\n",
    "\n",
    "days = set()\n",
    "\n",
    "for i in range(numParties):\n",
    "    a, b = list(map(int, input().split()))\n",
    "    currentDay = a\n",
    "\n",
    "    while currentDay<=numdays:\n",
    "        if currentDay%7 != 0 and currentDay%7 != 6:\n",
    "            days.add(currentDay)\n",
    "        currentDay+=b\n",
    "# print(days)\n",
    "print(len(days))\n",
    "    "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
