{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Функции и рекурсия. Часть 2."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 1. Ханойские башни**\n",
    "\n",
    "Головоломка “Ханойские башни” состоит из трех стержней, пронумерованных числами 1, 2, 3. На стержень 1 надета пирамидка из n дисков различного диаметра в порядке возрастания диаметра. Диски можно перекладывать с одного стержня на другой по одному, при этом диск нельзя класть на диск меньшего диаметра. Необходимо переложить всю пирамидку со стержня 1 на стержень 3 за минимальное число перекладываний.\n",
    "\n",
    "Напишите программу, которая решает головоломку; для данного числа дисков n печатает последовательность перекладываний в формате a b c, где a — номер перекладываемого диска,\n",
    "b — номер стержня с которого снимается данный диск, c — номер стержня на который надевается данный диск.\n",
    "\n",
    "Например, строка 1 2 3 означает перемещение диска номер 1 со стержня 2 на стержень 3. В одной строке печатается одна команда. Диски пронумерованы числами от 1 до n в порядке возрастания диаметров.\n",
    "\n",
    "Программа должна вывести минимальный (по количеству произведенных операций) способ перекладывания пирамидки из данного числа дисков.\n",
    "\n",
    "Указание: подумайте, как переложить пирамидку из одного диска? Из двух дисков? Из трех дисков? Из четырех дисков? Пусть мы научились перекладывать пирамидку из n дисков с произвольного стержня на любой другой, как переложить пирамидку из n+1 диска, если можно пользоваться решением для n дисков.\n",
    "\n",
    "Напишите функцию move (n, x, y), которая печатает последовательнось перекладываний дисков для перемещения пирамидки высоты n со стержня номер x на стержень номер y.\n",
    "\n",
    "Формат ввода: вводится натуральное число - количество дисков."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 1 3\n",
      "2 1 2\n",
      "1 3 2\n",
      "3 1 3\n",
      "1 2 1\n",
      "2 2 3\n",
      "1 1 3\n"
     ]
    }
   ],
   "source": [
    "# Это магия, что оно работает\n",
    "# Мы перекладываем пирамиду из n-1 дисков на свободный стережень, перемещаем самый нижний диск, и снова перекладываем, только теперь уже куда нужно\n",
    "\n",
    "def move(n, x ,y):\n",
    "    if n == 1:\n",
    "        print(n,x,y)\n",
    "    else:\n",
    "        all = [1,2,3]\n",
    "        all.remove(x)\n",
    "        all.remove(y)\n",
    "\n",
    "        z = all[0]\n",
    "\n",
    "        move(n-1,x,z)\n",
    "        print(n,x,y)\n",
    "        move(n-1,z, y)\n",
    "\n",
    "move(3, 1, 3)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 2. Сумма кубов**\n",
    "\n",
    "Напишите программу, которая представляет переданное натуральное число в виде суммы не более чем 7 кубов других натуральных чисел.\n",
    "\n",
    "Формат ввода: Входная строка содержит целое число N , которое нужно представить в виде суммы кубов.  \n",
    "Формат вывода: Программа должна вывести любое разложение переданного ей числа в виде суммы не более чем 7 кубов других натуральных чисел. Если такое разложение невозможно, программа должна вывести число 0.\n",
    "\n",
    "Пример 1. Ввод 5. Вывод 1 1 1 1 1.  \n",
    "Пример 2. Ввод 22. Вывод 0."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 8 1 1 1 1 1\n"
     ]
    }
   ],
   "source": [
    "import math\n",
    "\n",
    "def nToSum(n, m, deg):\n",
    "    if(n==0):\n",
    "        return []\n",
    "    arr =[]\n",
    "    i = math.floor(n ** (1./deg))\n",
    "    while i>0:\n",
    "        ret = nToSum(n-i**deg,m-1,deg)\n",
    "        if ret!=[0] and len(arr)+len(ret)+1<=m:\n",
    "            arr = arr + [i**deg] + ret\n",
    "            return arr\n",
    "        i-=1\n",
    "    return [0]\n",
    "\n",
    "print(' '.join(map(str,nToSum(int(input()),7,3))))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 3. Теорема Лагранжа**\n",
    "\n",
    "Теорема Лагранжа утверждает, что любое натуральное число можно представить в виде суммы четырех точных квадратов. По данному числу n найдите такое представление: напечатайте от 1 до 4 натуральных чисел, квадраты которых дают в сумме данное число.\n",
    "\n",
    "Пример 1. Ввод 4. Вывод 2.  \n",
    "Пример 2. Ввод 3. Вывод 1 1 1."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 2\n"
     ]
    }
   ],
   "source": [
    "a = nToSum(int(input()),4,2)\n",
    "for i in range(len(a)):\n",
    "    a[i] = math.floor(math.sqrt(a[i]))\n",
    "print(' '.join(map(str,a)))"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "30fc671ee31657b89ca62a1a3aacc4bc1c1d3331bade81200542509f75df2d34"
  },
  "kernelspec": {
   "display_name": "Python 3.9.7 64-bit ('venv': venv)",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
